[Timeout] BlockStatement
server.js:44:43
 app.use('/api', apiLimiter);
 
 // GET pending suggestions (used by the UI)
-app.get('/api/suggestions', (req, res) => {
-  // Security: Strictly validate status to prevent header injection in ETag
-  const status = req.query.status === 'all' ? 'all' : 'pending';
-
-  // Performance: Fast ETag validation using DB version and query status
-  // This avoids full JSON serialization and hashing if data hasn't changed.
-  const etag = `W/"v${db.getVersion()}-${status}"`;
-  if (req.header('If-None-Match') === etag) {
-    return res.status(304).send();
-  }
-
-  const suggestions = status === 'all' ? db.getAllSuggestions() : db.getPendingSuggestions();
-  res.set('ETag', etag);
-  res.json(suggestions);
-});
+app.get('/api/suggestions', (req, res) => {});
 
 // POST a new suggestion (used by agents)

[Killed] ConditionalExpression
server.js:46:18
 // GET pending suggestions (used by the UI)
 app.get('/api/suggestions', (req, res) => {
   // Security: Strictly validate status to prevent header injection in ETag
-  const status = req.query.status === 'all' ? 'all' : 'pending';
+  const status = true ? 'all' : 'pending';
 
   // Performance: Fast ETag validation using DB version and query status
killedBy: GET /api/suggestions returns only pending suggestions by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
server.js:46:18
 // GET pending suggestions (used by the UI)
 app.get('/api/suggestions', (req, res) => {
   // Security: Strictly validate status to prevent header injection in ETag
-  const status = req.query.status === 'all' ? 'all' : 'pending';
+  const status = req.query.status !== 'all' ? 'all' : 'pending';
 
   // Performance: Fast ETag validation using DB version and query status
killedBy: GET /api/suggestions returns only pending suggestions by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
server.js:50:16
 
   // Performance: Fast ETag validation using DB version and query status
   // This avoids full JSON serialization and hashing if data hasn't changed.
-  const etag = `W/"v${db.getVersion()}-${status}"`;
+  const etag = ``;
   if (req.header('If-None-Match') === etag) {
     return res.status(304).send();
killedBy: API Error Handling should strictly validate status query param and prevent ETag injection
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /-pending"$/
Received string:  "W/\"2-l9Fw4VUO7kr8CvBlt4zaMCqXZ0w\""

[Killed] EqualityOperator
server.js:51:7
   // Performance: Fast ETag validation using DB version and query status
   // This avoids full JSON serialization and hashing if data hasn't changed.
   const etag = `W/"v${db.getVersion()}-${status}"`;
-  if (req.header('If-None-Match') === etag) {
+  if (req.header('If-None-Match') !== etag) {
     return res.status(304).send();
   }
killedBy: API Error Handling should strictly validate status query param and prevent ETag injection
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Killed] ConditionalExpression
server.js:51:7
   // Performance: Fast ETag validation using DB version and query status
   // This avoids full JSON serialization and hashing if data hasn't changed.
   const etag = `W/"v${db.getVersion()}-${status}"`;
-  if (req.header('If-None-Match') === etag) {
+  if (true) {
     return res.status(304).send();
   }
killedBy: GET /api/suggestions returns empty array when no suggestions exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Killed] EqualityOperator
server.js:55:23
     return res.status(304).send();
   }
 
-  const suggestions = status === 'all' ? db.getAllSuggestions() : db.getPendingSuggestions();
+  const suggestions = status !== 'all' ? db.getAllSuggestions() : db.getPendingSuggestions();
   res.set('ETag', etag);
   res.json(suggestions);
killedBy: GET /api/suggestions returns only pending suggestions by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
server.js:55:23
     return res.status(304).send();
   }
 
-  const suggestions = status === 'all' ? db.getAllSuggestions() : db.getPendingSuggestions();
+  const suggestions = true ? db.getAllSuggestions() : db.getPendingSuggestions();
   res.set('ETag', etag);
   res.json(suggestions);
killedBy: GET /api/suggestions returns only pending suggestions by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] BlockStatement
server.js:61:63
 });
 
 // POST a new suggestion (used by agents)
-app.post('/api/suggestions', suggestionLimiter, (req, res) => {
-  const { title, description, context, agent } = req.body;
-
-  if (!title || !description) {
-    return res.status(400).json({ error: 'title and description are required' });
-  }
-
-  // Basic input validation
-  if (typeof title !== 'string' || title.length > 100) {
-    return res.status(400).json({ error: 'title must be a string up to 100 characters' });
-  }
-  if (typeof description !== 'string' || description.length > 1000) {
-    return res.status(400).json({ error: 'description must be a string up to 1000 characters' });
-  }
-  if (context && (typeof context !== 'string' || context.length > 5000)) {
-    return res.status(400).json({ error: 'context must be a string up to 5000 characters' });
-  }
-  if (agent && (typeof agent !== 'string' || agent.length > 100)) {
-    return res.status(400).json({ error: 'agent must be a string up to 100 characters' });
-  }
-
-  const suggestion = db.createSuggestion({ title, description, context, agent, user: req.identity.user });
-  res.status(201).json(suggestion);
-});
+app.post('/api/suggestions', suggestionLimiter, (req, res) => {});
 
 // PATCH to update status: approve, reject, defer

[Killed] BooleanLiteral
server.js:64:17
 app.post('/api/suggestions', suggestionLimiter, (req, res) => {
   const { title, description, context, agent } = req.body;
 
-  if (!title || !description) {
+  if (!title || description) {
     return res.status(400).json({ error: 'title and description are required' });
   }
killedBy: POST /api/suggestions: context validation rejects non-string context
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /context must be a string/
Received string:  "title and description are required"

[Killed] BooleanLiteral
server.js:64:7
 app.post('/api/suggestions', suggestionLimiter, (req, res) => {
   const { title, description, context, agent } = req.body;
 
-  if (!title || !description) {
+  if (title || !description) {
     return res.status(400).json({ error: 'title and description are required' });
   }
killedBy: POST /api/suggestions creates a suggestion with required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ObjectLiteral
server.js:65:33
   const { title, description, context, agent } = req.body;
 
   if (!title || !description) {
-    return res.status(400).json({ error: 'title and description are required' });
+    return res.status(400).json({});
   }
 
killedBy: POST /api/suggestions: boundary values returns 400 when both title and description are missing
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ConditionalExpression
server.js:69:7
   }
 
   // Basic input validation
-  if (typeof title !== 'string' || title.length > 100) {
+  if (true) {
     return res.status(400).json({ error: 'title must be a string up to 100 characters' });
   }
killedBy: POST /api/suggestions: context validation rejects non-string context
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /context must be a string/
Received string:  "title must be a string up to 100 characters"

[Killed] EqualityOperator
server.js:69:7
   }
 
   // Basic input validation
-  if (typeof title !== 'string' || title.length > 100) {
+  if (typeof title === 'string' || title.length > 100) {
     return res.status(400).json({ error: 'title must be a string up to 100 characters' });
   }
killedBy: Property: POST /api/suggestions validation accepts any valid string title and description
statusReason: Error: Property failed after 1 tests
{ seed: 1748978434, path: "0:0:0:0", endOnFailure: true }
Counterexample: [" "," "]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
server.js:72:7
   if (typeof title !== 'string' || title.length > 100) {
     return res.status(400).json({ error: 'title must be a string up to 100 characters' });
   }
-  if (typeof description !== 'string' || description.length > 1000) {
+  if (typeof description !== 'string' && description.length > 1000) {
     return res.status(400).json({ error: 'description must be a string up to 1000 characters' });
   }
killedBy: Property: POST /api/suggestions validation rejects descriptions longer than 1000 characters
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
server.js:72:69
   if (typeof title !== 'string' || title.length > 100) {
     return res.status(400).json({ error: 'title must be a string up to 100 characters' });
   }
-  if (typeof description !== 'string' || description.length > 1000) {
-    return res.status(400).json({ error: 'description must be a string up to 1000 characters' });
-  }
+  if (typeof description !== 'string' || description.length > 1000) {}
   if (context && (typeof context !== 'string' || context.length > 5000)) {
     return res.status(400).json({ error: 'context must be a string up to 5000 characters' });
killedBy: Property: POST /api/suggestions validation rejects descriptions longer than 1000 characters
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
server.js:75:50
   if (typeof description !== 'string' || description.length > 1000) {
     return res.status(400).json({ error: 'description must be a string up to 1000 characters' });
   }
-  if (context && (typeof context !== 'string' || context.length > 5000)) {
+  if (context && (typeof context !== 'string' || false)) {
     return res.status(400).json({ error: 'context must be a string up to 5000 characters' });
   }
killedBy: POST /api/suggestions: context validation rejects context longer than 5000 characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
server.js:75:19
   if (typeof description !== 'string' || description.length > 1000) {
     return res.status(400).json({ error: 'description must be a string up to 1000 characters' });
   }
-  if (context && (typeof context !== 'string' || context.length > 5000)) {
+  if (context && (false || context.length > 5000)) {
     return res.status(400).json({ error: 'context must be a string up to 5000 characters' });
   }
killedBy: POST /api/suggestions: context validation rejects non-string context
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] LogicalOperator
server.js:78:17
   if (context && (typeof context !== 'string' || context.length > 5000)) {
     return res.status(400).json({ error: 'context must be a string up to 5000 characters' });
   }
-  if (agent && (typeof agent !== 'string' || agent.length > 100)) {
+  if (agent && (typeof agent !== 'string' && agent.length > 100)) {
     return res.status(400).json({ error: 'agent must be a string up to 100 characters' });
   }
killedBy: POST /api/suggestions: agent validation rejects non-string agent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
server.js:78:17
   if (context && (typeof context !== 'string' || context.length > 5000)) {
     return res.status(400).json({ error: 'context must be a string up to 5000 characters' });
   }
-  if (agent && (typeof agent !== 'string' || agent.length > 100)) {
+  if (agent && (true)) {
     return res.status(400).json({ error: 'agent must be a string up to 100 characters' });
   }
killedBy: POST /api/suggestions: agent validation accepts agent at exactly 100 characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Timeout] BlockStatement
server.js:87:57
 });
 
 // PATCH to update status: approve, reject, defer
-app.patch('/api/suggestions/:id/:action', (req, res) => {
-  const { id, action } = req.params;
-
-  // Input validation: ensure ID is numeric
-  if (isNaN(id) || Number(id) <= 0) {
-    return res.status(400).json({ error: 'Invalid ID. Must be a positive number.' });
-  }
-
-  const validActions = ['approve', 'reject', 'defer'];
-  if (!validActions.includes(action)) {
-    return res.status(400).json({ error: `Invalid action. Must be one of: ${validActions.join(', ')}` });
-  }
-  const statusMap = { approve: 'approved', reject: 'rejected', defer: 'pending' };
-  const suggestion = db.updateStatus(Number(id), statusMap[action], req.identity.user);
-  if (!suggestion) {
-    return res.status(404).json({ error: 'Suggestion not found' });
-  }
-  res.json(suggestion);
-});
+app.patch('/api/suggestions/:id/:action', (req, res) => {});
 
 // Catch-all 404 for API routes to prevent leaking Express default HTML error pages

[Killed] ConditionalExpression
server.js:91:7
   const { id, action } = req.params;
 
   // Input validation: ensure ID is numeric
-  if (isNaN(id) || Number(id) <= 0) {
+  if (false) {
     return res.status(400).json({ error: 'Invalid ID. Must be a positive number.' });
   }
killedBy: API Error Handling should reject non-numeric IDs in PATCH route
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] ConditionalExpression
server.js:91:7
   const { id, action } = req.params;
 
   // Input validation: ensure ID is numeric
-  if (isNaN(id) || Number(id) <= 0) {
+  if (true) {
     return res.status(400).json({ error: 'Invalid ID. Must be a positive number.' });
   }
killedBy: Property: PATCH /api/suggestions/:id/:action valid actions always succeed on existing suggestions
statusReason: Error: Property failed after 1 tests
{ seed: -1267504630, path: "0", endOnFailure: true }
Counterexample: ["approve"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
server.js:92:33
 
   // Input validation: ensure ID is numeric
   if (isNaN(id) || Number(id) <= 0) {
-    return res.status(400).json({ error: 'Invalid ID. Must be a positive number.' });
+    return res.status(400).json({});
   }
 
killedBy: API Error Handling should reject non-numeric IDs in PATCH route
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] StringLiteral
server.js:95:36
     return res.status(400).json({ error: 'Invalid ID. Must be a positive number.' });
   }
 
-  const validActions = ['approve', 'reject', 'defer'];
+  const validActions = ['approve', "", 'defer'];
   if (!validActions.includes(action)) {
     return res.status(400).json({ error: `Invalid action. Must be one of: ${validActions.join(', ')}` });
killedBy: Property: PATCH /api/suggestions/:id/:action valid actions always succeed on existing suggestions
statusReason: Error: Property failed after 4 tests
{ seed: 389209726, path: "3", endOnFailure: true }
Counterexample: ["reject"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
server.js:95:25
     return res.status(400).json({ error: 'Invalid ID. Must be a positive number.' });
   }
 
-  const validActions = ['approve', 'reject', 'defer'];
+  const validActions = ["", 'reject', 'defer'];
   if (!validActions.includes(action)) {
     return res.status(400).json({ error: `Invalid action. Must be one of: ${validActions.join(', ')}` });
killedBy: Property: PATCH /api/suggestions/:id/:action valid actions always succeed on existing suggestions
statusReason: Error: Property failed after 4 tests
{ seed: -1047094591, path: "3", endOnFailure: true }
Counterexample: ["approve"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
server.js:96:7
   }
 
   const validActions = ['approve', 'reject', 'defer'];
-  if (!validActions.includes(action)) {
+  if (validActions.includes(action)) {
     return res.status(400).json({ error: `Invalid action. Must be one of: ${validActions.join(', ')}` });
   }
killedBy: Property: PATCH /api/suggestions/:id/:action valid actions always succeed on existing suggestions
statusReason: Error: Property failed after 1 tests
{ seed: -2049876949, path: "0:0", endOnFailure: true }
Counterexample: ["approve"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
server.js:96:7
   }
 
   const validActions = ['approve', 'reject', 'defer'];
-  if (!validActions.includes(action)) {
+  if (false) {
     return res.status(400).json({ error: `Invalid action. Must be one of: ${validActions.join(', ')}` });
   }
killedBy: Property: PATCH /api/suggestions/:id/:action invalid actions always return 400
statusReason: Error: Property failed after 1 tests
{ seed: 654459594, path: "0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
server.js:99:32
   if (!validActions.includes(action)) {
     return res.status(400).json({ error: `Invalid action. Must be one of: ${validActions.join(', ')}` });
   }
-  const statusMap = { approve: 'approved', reject: 'rejected', defer: 'pending' };
+  const statusMap = { approve: "", reject: 'rejected', defer: 'pending' };
   const suggestion = db.updateStatus(Number(id), statusMap[action], req.identity.user);
   if (!suggestion) {
killedBy: Property: PATCH /api/suggestions/:id/:action valid actions always succeed on existing suggestions
statusReason: Error: Property failed after 10 tests
{ seed: 255354989, path: "9", endOnFailure: true }
Counterexample: ["approve"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
server.js:101:7
   }
   const statusMap = { approve: 'approved', reject: 'rejected', defer: 'pending' };
   const suggestion = db.updateStatus(Number(id), statusMap[action], req.identity.user);
-  if (!suggestion) {
+  if (false) {
     return res.status(404).json({ error: 'Suggestion not found' });
   }
killedBy: Property: PATCH /api/suggestions/:id/:action actions on non-existent IDs return 404
statusReason: Error: Property failed after 1 tests
{ seed: -1731204815, path: "0:0", endOnFailure: true }
Counterexample: [999000,"approve"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
server.js:101:7
   }
   const statusMap = { approve: 'approved', reject: 'rejected', defer: 'pending' };
   const suggestion = db.updateStatus(Number(id), statusMap[action], req.identity.user);
-  if (!suggestion) {
+  if (suggestion) {
     return res.status(404).json({ error: 'Suggestion not found' });
   }
killedBy: Property: PATCH /api/suggestions/:id/:action valid actions always succeed on existing suggestions
statusReason: Error: Property failed after 1 tests
{ seed: -1690248751, path: "0", endOnFailure: true }
Counterexample: ["approve"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
server.js:108:31
 });
 
 // Catch-all 404 for API routes to prevent leaking Express default HTML error pages
-app.use('/api', (req, res) => {
-  res.status(404).json({ error: 'API endpoint not found' });
-});
+app.use('/api', (req, res) => {});
 
 // Global error handler to prevent stack trace leaks
killedBy: API Error Handling should return JSON 404 for non-existent API routes
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
server.js:109:24
 
 // Catch-all 404 for API routes to prevent leaking Express default HTML error pages
 app.use('/api', (req, res) => {
-  res.status(404).json({ error: 'API endpoint not found' });
+  res.status(404).json({});
 });
 
killedBy: API Error Handling should return JSON 404 for non-existent API routes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "API endpoint not found"
Received: undefined

[Timeout] BlockStatement
server.js:113:34
 });
 
 // Global error handler to prevent stack trace leaks
-app.use((err, req, res, next) => {
-  // If it's a JSON parsing error from express.json()
-  if (err instanceof SyntaxError && err.status === 400 && 'body' in err) {
-    return res.status(400).json({ error: 'Invalid JSON payload' });
-  }
-
-  // Handle entity too large error
-  if (err.status === 413) {
-    return res.status(413).json({ error: 'Payload too large' });
-  }
-
-  // Generic error handler
-  console.error(err.stack);
-  res.status(500).json({ error: 'Internal Server Error' });
-});
+app.use((err, req, res, next) => {});
 
 module.exports = app;

[Killed] BlockStatement
server.js:115:74
 // Global error handler to prevent stack trace leaks
 app.use((err, req, res, next) => {
   // If it's a JSON parsing error from express.json()
-  if (err instanceof SyntaxError && err.status === 400 && 'body' in err) {
-    return res.status(400).json({ error: 'Invalid JSON payload' });
-  }
+  if (err instanceof SyntaxError && err.status === 400 && 'body' in err) {}
 
   // Handle entity too large error
killedBy: Error handler: response body content invalid JSON returns non-empty error message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
server.js:115:7
 // Global error handler to prevent stack trace leaks
 app.use((err, req, res, next) => {
   // If it's a JSON parsing error from express.json()
-  if (err instanceof SyntaxError && err.status === 400 && 'body' in err) {
+  if (false) {
     return res.status(400).json({ error: 'Invalid JSON payload' });
   }
killedBy: Input Validation should not leak stack traces on invalid JSON
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
server.js:120:27
   }
 
   // Handle entity too large error
-  if (err.status === 413) {
-    return res.status(413).json({ error: 'Payload too large' });
-  }
+  if (err.status === 413) {}
 
   // Generic error handler
killedBy: Error handler: response body content payload too large returns non-empty error message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 413
Received: 500

[Killed] EqualityOperator
server.js:120:7
   }
 
   // Handle entity too large error
-  if (err.status === 413) {
+  if (err.status !== 413) {
     return res.status(413).json({ error: 'Payload too large' });
   }
killedBy: Error handler: response body content payload too large returns non-empty error message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 413
Received: 500

[Killed] StringLiteral
server.js:121:42
 
   // Handle entity too large error
   if (err.status === 413) {
-    return res.status(413).json({ error: 'Payload too large' });
+    return res.status(413).json({ error: "" });
   }
 
killedBy: Error handler: response body content payload too large returns non-empty error message
statusReason: Error: expect(received).toBeTruthy()

Received: ""

[NoCoverage] StringLiteral
server.js:126:33
 
   // Generic error handler
   console.error(err.stack);
-  res.status(500).json({ error: 'Internal Server Error' });
+  res.status(500).json({ error: "" });
 });
 

[NoCoverage] BlockStatement
server.js:131:30
 
 module.exports = app;
 
-if (require.main === module) {
-  const PORT = process.env.PORT || 3000;
-  const HOST = process.env.HOST || '127.0.0.1';
-  app.listen(PORT, HOST, () => {
-    console.log(`topornot server running on http://${HOST}:${PORT}`);
-  });
-}
+if (require.main === module) {}
 

[NoCoverage] ConditionalExpression
server.js:132:16
 module.exports = app;
 
 if (require.main === module) {
-  const PORT = process.env.PORT || 3000;
+  const PORT = true;
   const HOST = process.env.HOST || '127.0.0.1';
   app.listen(PORT, HOST, () => {

[NoCoverage] ConditionalExpression
server.js:132:16
 module.exports = app;
 
 if (require.main === module) {
-  const PORT = process.env.PORT || 3000;
+  const PORT = false;
   const HOST = process.env.HOST || '127.0.0.1';
   app.listen(PORT, HOST, () => {

[NoCoverage] ConditionalExpression
server.js:133:16
 
 if (require.main === module) {
   const PORT = process.env.PORT || 3000;
-  const HOST = process.env.HOST || '127.0.0.1';
+  const HOST = false;
   app.listen(PORT, HOST, () => {
     console.log(`topornot server running on http://${HOST}:${PORT}`);

[NoCoverage] ConditionalExpression
server.js:133:16
 
 if (require.main === module) {
   const PORT = process.env.PORT || 3000;
-  const HOST = process.env.HOST || '127.0.0.1';
+  const HOST = true;
   app.listen(PORT, HOST, () => {
     console.log(`topornot server running on http://${HOST}:${PORT}`);

[NoCoverage] BlockStatement
server.js:134:32
 if (require.main === module) {
   const PORT = process.env.PORT || 3000;
   const HOST = process.env.HOST || '127.0.0.1';
-  app.listen(PORT, HOST, () => {
-    console.log(`topornot server running on http://${HOST}:${PORT}`);
-  });
+  app.listen(PORT, HOST, () => {});
 }
 
